In [1]:
import pandas as pd

# pandas DataFrame

In [2]:
emp=pd.DataFrame()

In [3]:
emp

Empty DataFrame
Columns: []
Index: []

In [4]:
lst=[1,2,3,4]
df1=pd.DataFrame(lst)
df1

   0
0  1
1  2
2  3
3  4

In [5]:
lst_lst=[[1,2,3,4,5],[1,2,3,4,5]]
df2=pd.DataFrame(lst_lst)
df2

   0  1  2  3  4
0  1  2  3  4  5
1  1  2  3  4  5

In [6]:
dic={"name":["rahul","rithik","ankush"]}
df3=pd.DataFrame(dic)
df3

     name
0   rahul
1  rithik
2  ankush

In [7]:
dic={"name":["rahul","rithik","ankush"],"age":[23,20,16]}
df4=pd.DataFrame(dic)
df4

     name  age
0   rahul   23
1  rithik   20
2  ankush   16

In [8]:
ls_dic=[{'a':1,'b':2},{'c':3,'d':4}]
df4=pd.DataFrame(ls_dic)
df4

     a    b    c    d
0  1.0  2.0  NaN  NaN
1  NaN  NaN  3.0  4.0

In [9]:
dict_sir={'id':pd.Series([1,2,3,4]),'sn':pd.Series([11,22,33,44])}
df5=pd.DataFrame(dict_sir)
df5

   id  sn
0   1  11
1   2  22
2   3  33
3   4  44